// Написать программу где заданное число выдаёт квадрат этого числа 
Console.Write("Введите число");
int number = Convert.ToInt32(Console.ReadLine());
int square = number * number ;
System.Console.WriteLine($"квадрат данного числа равен{square}");

