//Напишите программу ,которая на вход принимает  число и проверяет делится оно на 2 без остатка 
System.Console.WriteLine("Введите число");
 int number = Convert.ToInt32(Console.ReadLine());
 if ( number % 2 == 0)
 {
    System.Console.WriteLine("чётное");
 }
 else

 {
    System.Console.WriteLine("нечётное");
 }
